Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/standards_and_accountability/comptroller_and_auditor_general.html.txt.tmx
Source language: en
Languages: ga

source: Comptroller and Auditor General
ga: An tArd-Reachtaire Ciste agus Cuntas

source: The Irish Constitution states that a Comptroller and Auditor General must be appointed
ga: Sonraíonn Bunreacht na hÉireann go gcaithfear Ard-Reachtaire Cuntas agus Ciste a cheapadh

source: The main function of the Comptroller and Auditor General is to carry out an audit every year of the State's accounts
ga: Is é príomhdhualgas an Ard-Reachtaire Cuntas agus Ciste ná iniúchadh a dhéanamh go bliantúil ar chuntais stáit na hÉireann

source: He or she then submits an annual report of the audit to Dáil Eireann
ga: Ina dhiaidh sin, seolann sé nó sí tuarascáil bhliantúil ar an iniúchadh chuig Dáil Éireann

source: The Comptroller and Auditor General is nominated by Dáil Eireann and appointed by the Irish President
ga: Ainmníonn Dáil Éireann an tArd-Reachtaire Cuntas agus Ciste agus ceapann Uachtarán na hÉireann é/í

source: You can read further information on the current Comptroller and Auditor General on audgen.gov.ie
ga: Tá eolas ar an tArd-Reachtaire Cuntas agus Ciste laithreach ar audgen.gov.ie

source: The Comptroller and Auditor General is also the Supreme Audit Institution (SAI) for Ireland
ga: Is é Ard-Reachtaire Cuntas agus Ciste na hÉireann Uasfhoras Iniúchóireachta (SAI) na hÉireann freisin

source: Supreme Audit Institutions in Ireland and abroad are linked through a number of regional and international bodies:
ga: Bíonn Uasfhorais Iniúchóireachta in Éirinn agus thar lear ceangailte trí roinnt forais réigiúnacha agus idirnáisiúnta:

source: • The European Organisation of Supreme Audit Institutions (EUROSAI)
ga: • Eagraíochtaí Eorpacha na nArdfhoras Iniúchóireachta (European Organisation of Supreme Audit Institutions) (EUROSAI)

source: • The International Organisation of Supreme Audit Institutions (INTOSAI) The Comptroller and Auditor General cannot be a member of the Oireachtas (the Irish Houses of Parliament)
ga: • Eagraíochtaí Idirnáisiúnta na nArdfhoras Iniúchóireachta (International Organisation of Supreme Audit Institutions) (INTOSAI)

source: You can see an overview of government expenditure on whereyourmoneygoes.gov.ie, a website of the Office of the Government Chief Information Officer
ga: Níl cead ag an Ard-Reachtaire Ciste agus Cuntas a bheith ina bhall den Oireachtas
